2018/google.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-10-31 四 11:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Google 搜索</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Google 搜索</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgae86289">1. Google 搜索</a></li>
<li><a href="#orgbbe28be">2. 快速获得解答</a></li>
<li><a href="#orgd259fd9">3. 搜索运算符</a>
<ul>
<li><a href="#org3f6eddd">3.1. 搜索符号</a></li>
<li><a href="#org57d7ff6">3.2. 搜索字词</a></li>
</ul>
</li>
<li><a href="#orgdace935">4. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgae86289" class="outline-2">
<h2 id="orgae86289"><span class="section-number-2">1</span> Google 搜索</h2>
<div class="outline-text-2" id="text-1">
<p>
谷歌是世界上最好的搜索引擎， 然而因为一些原因， 在国内的使用并不方便。
</p>

<p>
如果有能力的话， 可以直接使用谷歌搜索：
</p>
<ul class="org-ul">
<li><a href="https://www.google.com/webhp">谷歌搜索</a></li>
</ul>

<p>
当然， 也可以使用镜像：
</p>
<ul class="org-ul">
<li><a href="https://google.jiongjun.cc/">谷歌镜像站</a></li>
</ul>

<p>
同时， 如果掌握一些搜索技巧的话， 也会有很多帮助。
</p>

<p>
<b>Update 2018-05-28:</b> <code>Google</code> 因为一些原因导致有时中文搜索的效果不是很好，这时可以选择将需要搜索的内容翻译为 <b>英文</b> 搜索， 可能有惊喜。
</p>
</div>
</div>

<div id="outline-container-orgbbe28be" class="outline-2">
<h2 id="orgbbe28be"><span class="section-number-2">2</span> 快速获得解答</h2>
<div class="outline-text-2" id="text-2">
<p>
Google 可以在搜索结果页上直接给出某些搜索字词的相关解答
</p>

<ul class="org-ul">
<li><b>天气：</b> 搜索 <code>天气</code> 可查看所在地点的天气信息，如果在 <code>天气</code> 后加上城市名(如 <code>天气北京</code>)， 则可查看相应城市的天气信息</li>
<li><b>字典：</b> 在任意字词前加上 <code>定义</code> 即可查询其定义， 如 <code>定义谷歌</code></li>
<li><b>计算：</b> 输入数学公式(例如 <code>3*9123</code>)或求解复杂的图形公式</li>
<li><b>单位换算：</b> 输入任何换算内容，例如 <code>3 美元 人民币</code></li>
<li><b>颜色代码：</b> 输入一个颜色代码可直接显示对应颜色， 如 <code>#FFFFFF</code></li>
<li><b>基本信息：</b> 搜索名人、地点、电影或歌曲的名称即可看到相关信息</li>
</ul>
</div>
</div>

<div id="outline-container-orgd259fd9" class="outline-2">
<h2 id="orgd259fd9"><span class="section-number-2">3</span> 搜索运算符</h2>
<div class="outline-text-2" id="text-3">
<p>
使用搜索运算符需要注意的是：
</p>
<ul class="org-ul">
<li>Google 搜索通常会忽略不属于搜索运算符的标点符号</li>
<li>不要在符号/字词和搜索字词之间加上空格。 例如， <code>site:nytimes.com</code> 可以正常发挥作用，但 <code>site: nytimes.com</code> 则不行</li>
</ul>
</div>

<div id="outline-container-org3f6eddd" class="outline-3">
<h3 id="org3f6eddd"><span class="section-number-3">3.1</span> 搜索符号</h3>
<div class="outline-text-3" id="text-3-1">
<dl class="org-dl">
<dt>逻辑与 +</dt><dd>包含后面的字词， 如： <code>测试 +测试</code></dd>
<dt>逻辑非 -</dt><dd>排除后面的字词， 如： <code>游戏 -小游戏</code></dd>
<dt>逻辑或 |</dt><dd>包含任意一个字词， 如： <code>游戏 |作业</code></dd>
<dt>通配符 *</dt><dd>匹配任意字词， 如： <code>单*</code></dd>
<dt>完全匹配 ""</dt><dd>完全匹配引起来的字词， 如： "游戏4576"</dd>
<dt>数字范围 ..</dt><dd>在指定范围搜索， 如： <code>200..100</code></dd>
<dt>价格 $</dt><dd>搜索指定价格， 如： <code>$10..$20</code></dd>
</dl>
</div>
</div>

<div id="outline-container-org57d7ff6" class="outline-3">
<h3 id="org57d7ff6"><span class="section-number-3">3.2</span> 搜索字词</h3>
<div class="outline-text-3" id="text-3-2">
<dl class="org-dl">
<dt>OR</dt><dd>逻辑或， 同 <code>|</code></dd>
<dt>define:</dt><dd>搜索关键词的定义， 如： <code>define:鬼畜</code></dd>
<dt>filetype:</dt><dd>搜索指定的文件类型(等价于 <code>ext:</code>)， 如： <code>filetype:flv</code></dd>
<dt>intitle:</dt><dd>搜索标题包含关键词的网页， 如： <code>intitle:bi</code></dd>
<dt>allintitle:</dt><dd>类似 <code>intitle:</code>, 限定多个关键词， 如： <code>allintitle:123 456</code></dd>
<dt>inurl:</dt><dd>搜索 <code>url</code> 中含指定关键词的网页， 如： <code>inurl:kkk</code></dd>
<dt>allinurl:</dt><dd>类似 <code>inurl:</code>, 限定多个关键词， 如： <code>allinurl:123 456</code></dd>
<dt>inanchor:</dt><dd>搜索 页面链接锚(<code>#</code> 开头的页内链接) 文本中含指定关键词的网页， 如： <code>inanchor:测试</code></dd>
<dt>allinanchor:</dt><dd>类似 <code>inanchor:</code>, 限定多个关键词， 如： <code>allinanchor:123 456</code></dd>
<dt>intext:</dt><dd>搜索正文文本中含指定关键词的网页， 如： <code>intext:1234567890</code></dd>
<dt>site:</dt><dd>搜索特定网站， 如： <code>site:youtube.com</code></dd>
<dt>link:</dt><dd>搜索链向某网站/网址的网页， 如： <code>link:www.google.com</code></dd>
<dt>related:</dt><dd>搜索相关网站， 如： <code>related:www.google.com</code></dd>
<dt>info:</dt><dd>获取网站详情， 如： <code>related:time.com</code></dd>
<dt>cache:</dt><dd>查看网站的 Google 缓存版本， 如： <code>cache:time.org</code></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orgdace935" class="outline-2">
<h2 id="orgdace935"><span class="section-number-2">4</span> 参考链接</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://support.google.com/websearch/answer/134479?hl=zh-Hans&amp;ref_topic=3081620">Google 搜索帮助</a></li>
<li><a href="http://blog.jobbole.com/72211/">这些 Google 高级搜索技巧，你都知道么？</a></li>
<li><a href="https://sites.google.com/site/zzllrr/google-search-tips">谷歌搜索技巧Google Search Tips（终极整理Ultimate Version）</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
